# Pandas

#### Pandas => Panel data or Python Data Analysis

##### Pandas is a python library that has functions for analysing, cleaning, exploring and manipulating datasets

In [2]:
import pandas as pd
p.__version__

'1.4.2'

#### pandas series

series  is a one-dimensional array which is like a column ia table

In [3]:
a = [1,2,3,4,5]
b = pd.Series(a)
print(type(b))
b

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: int64

Label: to acces specified value in series

In [6]:
a = [1,2,3,4,5]
b = pd.Series(a, index=['A', 'B', 'C', 'D', 'E'])
b

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
data = {'a':1, 'b':2, 'c':3}
data = pd.Series(data)
data

a    1
b    2
c    3
dtype: int64

In [8]:
data = {'a':1, 'b':2, 'c':3}
data = pd.Series(data, index=['a', 'b'])
data

a    1
b    2
dtype: int64

## Dataframe

Series - column in a table

Dataframe - 2-dimensional table

In [13]:
data = {
    "a":[1,2,3,4,5],
    "b":[6,7,8,9,10]
}
data = pd.DataFrame(data, index=["a","b","c","d","e"])
data

   a   b
a  1   6
b  2   7
c  3   8
d  4   9
e  5  10

#### loc()

=> label based data selection

In [19]:
data = pd.DataFrame({'Brand': ['Tata', 'Hyundai', 'Tata',
                               'Mahindra', 'Maruti', 'Hyundai',
                               'Renault', 'Tata', 'Maruti'],
                     'Year': [2012, 2014, 2011, 2015, 2012,
                              2016, 2014, 2018, 2019],
                     'Kms Driven': [50000, 30000, 60000,
                                    25000, 10000, 46000,
                                    31000, 15000, 12000],
                     'City': ['Gurgaon', 'Delhi', 'Mumbai',
                              'Delhi', 'Mumbai', 'Delhi',
                              'Mumbai', 'Chennai',  'Ghaziabad'],
                     'Mileage':  [28, 27, 25, 26, 28,
                                  29, 24, 21, 24]})
data

      Brand  Year  Kms Driven       City  Mileage
0      Tata  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [23]:
data.loc[(data.Brand == 'Tata') & (data['Kms Driven'] >= 30000)]

  Brand  Year  Kms Driven     City  Mileage
0  Tata  2012       50000  Gurgaon       28
2  Tata  2011       60000   Mumbai       25

In [24]:
data.loc[3:5]

      Brand  Year  Kms Driven    City  Mileage
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

In [29]:
data.loc[[2]]

  Brand  Year  Kms Driven    City  Mileage
2  Tata  2011       60000  Mumbai       25

In [39]:
data.loc[[2,5]]

     Brand  Year  Kms Driven    City  Mileage
2     Tata  2011       60000  Mumbai       25
5  Hyundai  2016       46000   Delhi       29

#### iloc()

=> index based data selection

In [36]:
data.iloc[2,0]

'Tata'

In [38]:
data.iloc[[2,0]]

  Brand  Year  Kms Driven     City  Mileage
2  Tata  2011       60000   Mumbai       25
0  Tata  2012       50000  Gurgaon       28

In [44]:
data.iloc[1:3, 2:4]

   Kms Driven    City
1       30000   Delhi
2       60000  Mumbai

### Storing datasets

1) csv files => these are stored using read_csv function

2) json files => these are stored using read_json function

In [51]:
df = pd.read_csv('netflix.csv')

### Analysing the datasets

In [52]:
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [53]:
df.tail()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

### info()  
=> gives the count of total data entries

=> gives name of the labels in dataset

=> gives details about null and non-null values in the dataset

=> gives the datatype of each column

#### isna()
=> checks for null value in the dataset

In [61]:
df.isna().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

#### dropna() 
=> removes the entire row that have null values in the dataset and returns new dataframe
#### fillna()
=> allows to replace the empty cells with valid data

In [64]:
df1 = df.dropna()
print(df1.isna().sum())
df1.info()

show_id         0
type            0
title           0
director        0
cast            0
country         0
date_added      0
release_year    0
rating          0
duration        0
listed_in       0
description     0
dtype: int64
<class 'pandas.core.frame.DataFrame'>
Int64Index: 5332 entries, 7 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       5332 non-null   object
 1   type          5332 non-null   object
 2   title         5332 non-null   object
 3   director      5332 non-null   object
 4   cast          5332 non-null   object
 5   country       5332 non-null   object
 6   date_added    5332 non-null   object
 7   release_year  5332 non-null   int64
 8   rating        5332 non-null   object
 9   duration      5332 non-null   object
 10  listed_in     5332 non-null   object
 11  description   5332 non-null   object
dtypes: int64(1), object(11)
memory usage: 541.5+ KB

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

#### duplicates
=> duplicated(0 is used to find the duplicates in dataframe

In [72]:
df.duplicated().sum()

0

In [74]:
df.dropna(inplace=True)

### Data Correlations

##### corr()
 => calculates relationship between each columns in the dataset 
 
 => It ignores the non numeric columns
 
 => correlation value varies from -1 to 1

In [98]:
dft = pd.read_csv('titanic.csv')

In [99]:
dft.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [100]:
dft['Age'].fillna(dft['Age'].mean(), inplace=True)
dft['Embarked'].fillna('S', inplace=True)

In [101]:
dft.drop(['Cabin'], axis=1, inplace=True)

In [102]:
dft.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [103]:
dft.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.033207,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.069809,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.331339,0.083081,0.018443,-0.549500
Age,0.033207,-0.069809,-0.331339,1.000000,-0.232625,-0.179191,0.091566
SibSp,-0.057527,-0.035322,0.083081,-0.232625,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.179191,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.091566,0.159651,0.216225,1.000000